[
   {
    "version": "3.2",
    "date": "10/10/2025",
    "notes": [
      "Thêm bộ lọc ( hình răng cưa ) vào 3 bảng Hiệu quả khai thác, Nhóm hàng quy đổi cao, Ngành hàng chi tiết trong Siêu thị lũy kế và realtime",
      "Sửa lại giao diện khu vực cập nhật dữ liệu cho gọn hơn"
    ]
  },  
  {
    "version": "3.1",
    "date": "09/10/2025",
    "notes": [
      "Thêm 2 thẻ KPI mới cho tab siêu thị lũy kế",
      "Thêm chức năng cài đặt màu chữ thẻ KPI trong cài đặt giao diện"
    ]
  },  
   {
    "version": "3.0",
    "date": "06/10/2025",
    "notes": [
      "Nâng cấp tính năng tạo chương trình thi đua và theo dõi hiệu quả thi đua : Có thể theo dõi cùng lúc nhiều hãng trong cùng 1 nhóm hàng.",
      "Nâng cấp tính năng nhận xét:cho phép tạo nhận xét cho nhiều tab phụ.",
      "Nâng cấp tính năng nhận xét: Thêm bộ lọc tất cả nhân viên dưới mục tiêu khai báo"
    ]
  },  
  {
    "version": "2.8",
    "date": "01/10/2025",
    "notes": [
      "Thêm tính năng tạo chương trình thi đua và theo dõi hiệu quả thi đua."
    ]
  },
    {
    "version": "2.7",
    "date": "26/09/2025",
    "notes": [
      "Thêm tính năng thông báo có phiên bản mới.",
      "Thêm tính năng video hướng dẫn ngoài trang chủ.",
      "Thêm bộ đếm lượt truy cập và sử dụng."
    ]
  },
{
    "version": "2.6",
    "date": "25/09/2025",
    "notes": [
      "Sửa lỗi tính năng sắp xếp trên tất cả các bảng.",
      "Phục hồi báo cáo 'Thi đua NV' và 'Hiệu quả khai thác LK'.",
      "Sửa lỗi 'Thiết lập mục tiêu' cập nhật không tức thời.",
      "Sửa lỗi bộ lọc nâng cao không hiển thị dữ liệu."
    ]
  },
  {
    "version": "2.5",
    "date": "24/09/2025",
    "notes": [
      "Thêm tính năng xử lý file thi đua theo vùng trong 'Sức khỏe siêu thị.",
      "Nâng cấp tính năng 'Nhận xét' : thêm icon, thêm các thẻ tùy chọn"
    ]
  },
    {
    "version": "2.2",
    "date": "23/09/2025",
    "notes": [
      "Sửa lỗi nghiêm trọng: Tính toán sai giá trị doanh thu sau khi cập nhật bộ lọc.",
      "Cấu trúc lại hệ thống quản lý phiên bản và lịch sử cập nhật."
    ]
  },
  {
    "version": "2.1",
    "date": "23/09/2025",
    "notes": [
      "Sửa lỗi bộ lọc nâng cao không có dữ liệu để chọn.",
      "Sửa lỗi tô màu tiêu đề bảng không hoạt động do sai CSS Selector."
    ]
  },
  {
    "version": "2.0",
    "date": "16/09/2025",
    "notes": [
      "Phiên bản phát hành đầu tiên.",
      "Bao gồm các chức năng cốt lõi: SKNV, SKST Lũy kế, Doanh thu Realtime."
    ]
  }
]